server/tests/load-test.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 20
      arrivalRate: 50
      rampTo: 200
      name: Warm up phase
    - duration: 20
      arrivalRate: 200
      rampTo: 1000
      name: Ramp up load
    - duration: 20
      arrivalRate: 1000
      rampTo: 10000
      name: Spike phase
scenarios:
  - name: "vote calabreso"
    weight: 54
    flow:
      - post:
          url: "/votes"
          json:
            candidateId: "Calabreso"
  - name: "vote bambam"
    weight: 32
    flow:
      - post:
          url: "/votes"
          json:
            candidateId: "Bambam"
  - name: "vote prior"
    weight: 24
    flow:
      - post:
          url: "/votes"
          json:
            candidateId: "Prior"