server/tests/load-test.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 50
      name: Warm up phase
    - duration: 30
      arrivalRate: 50
      rampTo: 200
      name: Ramp up load
    # - duration: 60
    #   arrivalRate: 200
    #   rampTo: 5000
    #   name: Spike phase
scenarios:
  - name: "vote calabreso"
    weight: 54
    flow:
      - post:
          url: "/votes"
          json:
            candidateId: "Calabreso"
  - name: "vote bambam"
    weight: 32
    flow:
      - post:
          url: "/votes"
          json:
            candidateId: "Bambam"
  - name: "vote prior"
    weight: 24
    flow:
      - post:
          url: "/votes"
          json:
            candidateId: "Prior"